pg-xml.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ext="http://external.interfaces.ers.seamless.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ext:requestPrincipalInformation>
            <!--Optional:-->
            <context>
                <!--Optional:-->
                <channel>WSClient</channel>
                <!--Optional:-->
                <clientComment>?</clientComment>
                <!--Optional:-->
                <clientId>ERS</clientId>
                <!--Optional:-->
                <clientReference>1234567</clientReference>
                <clientRequestTimeout>500</clientRequestTimeout>
                <!--Optional:-->
                <initiatorPrincipalId>
                    <!--Optional:-->
                    <id>00520120607165829AG</id>
                    <!--Optional:-->
                    <type>RESELLERUSER</type>
                    <!--Optional:-->
                    <userId>9900</userId>
                </initiatorPrincipalId>
                <!--Optional:-->
                <password>mmt10mmt10</password>
            </context>
            <!--Optional:-->
            <principalId>
                <!--Optional:-->
                <id>00520120607165829AG</id>
                <!--Optional:-->
                <type>RESELLERUSER</type>
                <!--Optional:-->
                <userId>9900</userId>
            </principalId>
        </ext:requestPrincipalInformation>
    </soapenv:Body>
</soapenv:Envelope>
